[
  {
    "id": "regular-chicken-pickle",
    "title": "Regular Chicken Pickle",
    "image": "/ChickenPickle.jpg",
    "description": "Our Chicken Pickle is a homemade delicacy, crafted with juicy chicken pieces slow-cooked in our rich blend of Indian spices like turmeric, red chili, jeera, and garam masala. Spicy, tangy, and full of desi flavors, it’s the perfect companion to our everyday meals!",
    "slogan": "Taste the tradition with every bite!",
    "preparation_steps": [
      "Wash and pat dry chicken",
      "Cut it into small bite-sized pieces.",
      "Heat a pan and dry roast the chicken pieces for 5-7 minutes to remove moisture.",
      "Add a little turmeric powder and salt while roasting.",
      "Once the chicken is partially cooked, set it aside.",
      "Dry roast 1 tbsp cumin seeds, coriander seeds, and fennel seeds.",
      "Grind them into a coarse powder.",
      "Heat 1 cup of peanut or sunflower oil in a pan.",
      "Add 1 tsp mustard seeds and let them splutter.",
      "Add 1 tbsp ginger-garlic paste and sauté until golden brown.",
      "Add 1 tsp turmeric powder, red chili powder, garam masala, and the ground spice mix.",
      "Mix well and cook for a minute.",
      "Add the pre-cooked chicken to the masala and mix well.",
      "Cook on low flame until the chicken absorbs the flavors and the oil separates.",
      "Add vinegar and mix well.",
      "Optionally, add lemon juice for extra tanginess.",
      "Let it cook for another 5 minutes.",
      "Allow the pickle to cool completely. Store in a clean, dry glass jar.",
      "Let it sit for 1-2 days for the flavors to blend before consuming.",
      "The boneless chicken pickle is now ready to enjoy! 😊 Serve with rice or chapati."
    ],
    "rate": 4.7,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 237,
    "max_price": 900,
    "min_price": 549
  },
  {
    "id": "boneless-chicken-pickle",
    "title": "Boneless Chicken Pickle",
    "image": "/BonelessChickenPickle.jpg",
    "description": "Our Boneless Chicken Pickle is a rich and flavorful treat, made with tender, boneless chicken pieces slow-cooked in our special blend of Indian spices, edible oil, and aromatic herbs. Spicy, tangy, and full of homemade goodness, it’s the perfect side for our everyday meals!",
    "slogan": "Juicy, tender, and irresistibly spicy!",
    "preparation_steps": [
      "Wash and pat dry boneless chicken",
      "Cut it into small bite-sized pieces.",
      "Heat a pan and dry roast the chicken pieces for 5-7 minutes to remove moisture.",
      "Add a little turmeric powder and salt while roasting.",
      "Once the chicken is partially cooked, set it aside.",
      "Dry roast 1 tbsp cumin seeds, 1 tbsp coriander seeds, and 1 tsp fennel seeds.",
      "Grind them into a coarse powder.",
      "Heat 1 cup of peanut or sunflower oil in a pan.",
      "Add 1 tsp mustard seeds and let them splutter.",
      "Add 1 tbsp ginger-garlic paste and sauté until golden brown.",
      "Add 1 tsp turmeric powder, 2 tbsp red chili powder, 1 tbsp garam masala, and the ground spice mix.",
      "Mix well and cook for a minute.",
      "Add the pre-cooked chicken to the masala and mix well.",
      "Cook on low flame until the chicken absorbs the flavors and the oil separates.",
      "Add 2 tbsp vinegar and mix well.",
      "Optionally, add 1 tbsp lemon juice for extra tanginess.",
      "Let it cook for another 5 minutes.",
      "Allow the pickle to cool completely. Store in a clean, dry glass jar.",
      "Let it sit for 1-2 days for the flavors to blend before consuming.",
      "The boneless chicken pickle is now ready to enjoy! 😊 Serve with rice or chapati."
    ],
    "rate": 4.5,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 185,
    "max_price": 1000,
    "min_price": 550
  },
  {
    "id": "gongura-chicken-pickle",
    "title": "Gongura Chicken Pickle",
    "image": "/GonguraChickenPickle.jpg",
    "description": "Our Gongura Chicken Pickle is a unique blend of tender chicken and tangy gongura leaves, slow-cooked with our rich mix of Indian spices and pure peanut or sunflower oil. Bursting with spicy, sour, and authentic flavors, it’s the perfect way to add a traditional touch to our meals!",
    "slogan": "A tangy twist to your chicken pickle!",
    "preparation_steps": [
      "Wash and cut the chicken into small pieces.",
      "Boil the chicken with turmeric, salt, and a little water until fully cooked.",
      "Once cooked, drain any excess water and let it cool.",
      "Wash and dry the gongura leaves completely.",
      "Heat a pan and dry-roast the leaves until they become soft and slightly mushy. Set aside.",
      "Dry roast red chilies, cumin seeds, mustard seeds, and coriander seeds. Grind them into a coarse powder.",
      "Heat oil in a pan and deep-fry the cooked chicken pieces until golden brown and crispy. Set aside.",
      "In the same oil, add mustard seeds, garlic cloves, curry leaves, and dry red chilies.",
      "Sauté until the garlic turns golden brown.",
      "Add the mashed gongura leaves and cook for a few minutes.",
      "Mix in the spice powder and fried chicken pieces.",
      "Stir well, ensuring the chicken is coated with the gongura mixture.",
      "Cook on low heat for a few more minutes, allowing the flavors to blend.",
      "Let the pickle cool completely before storing in an airtight glass jar. It stays fresh for weeks when stored properly.",
      "Enjoy your flavorful Gongura Chicken Pickle with hot rice or chapati! 😊🔥"
    ],
    "rate": 4.8,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 298,
    "max_price": 800,
    "min_price": 500
  },
  {
    "id": "regular-prawns-pickle",
    "title": "Regular Prawns Pickle",
    "image": "/PrawnsPickle.jpg",
    "description": "Our Prawns Pickle is a flavorful delight, made with juicy prawns slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, tangy, and packed with coastal goodness, it’s the perfect companion to our everyday meals!",
    "slogan": "Dive into the coastal flavors!",
    "preparation_steps": [
      "Wash and devein the prawns thoroughly.",
      "Pat them dry completely to remove excess moisture.",
      "Mix the prawns with salt, turmeric powder, and red chili powder.",
      "Let it sit for 15-20 minutes.",
      "Heat oil in a pan and deep-fry the prawns until they turn golden brown and crispy.",
      "Remove and set aside.",
      "In the same oil, add mustard seeds and let them splutter.",
      "Add ginger-garlic paste and sauté until the raw smell disappears.",
      "Add red chili powder, turmeric powder, cumin powder, coriander powder,nd fenugreek powder.",
      "Stir well and cook for a minute on low flame.",
      "Pour tamarind extract and vinegar into the spice mix.",
      "Cook until the mixture thickens.",
      "Add the fried prawns to the prepared spice mix.",
      "Mix well so the prawns absorb the flavors.",
      "Let the pickle cool completely before transferring it to an airtight jar.",
      "Store at room temperature for a day and then refrigerate for longer shelf life.",
      "The prawns pickle is now ready to enjoy! 🍤🔥"
    ],
    "rate": 4.9,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 410,
    "max_price": 800,
    "min_price": 500
  },
  {
    "id": "gongura-prawns-pickle",
    "title": "Gongura Prawns Pickle",
    "image": "/GonguraPrawnsPickle.jpg",
    "description": "Our Gongura Prawns Pickle is a delicious fusion of juicy prawns and tangy gongura leaves, slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, sour, and packed with authentic flavors, it’s the perfect way to add a traditional touch to our meals!",
    "slogan": "A tangy twist to your prawns pickle!",
    "preparation_steps": [
      "Wash and devein the prawns thoroughly.",
      "Pat them dry completely to remove excess moisture.",
      "Heat oil in a pan and fry the prawns on medium flame until they turn golden and slightly crispy.",
      "Remove and set aside.",
      "Wash the gongura (sorrel) leaves and dry them completely.",
      "Heat oil in a pan and sauté the leaves until they become soft and mushy.",
      "In the same pan, dry roast mustard seeds, fenugreek seeds, cumin, and red chilies until aromatic.",
      "Grind them into a fine powder.",
      "Heat oil in a pan, add mustard seeds, garlic, and curry leaves.",
      "Add turmeric, red chili powder, salt, and the ground spice mix.",
      "Mix in the cooked gongura paste and let it simmer.",
      "Stir in the fried prawns and mix well to coat with the spice mixture.",
      "Let it cook on low heat for 10 minutes, ensuring the flavors blend well.",
      "Allow the pickle to cool completely.",
      "Store it in an airtight glass jar with a layer of oil on top for preservation.",
      "Let the pickle rest for a day to enhance the flavor.",
      "The sour and savoury gongura prawns pickle is now ready to enjoy! 🍤🔥"
    ],
    "rate": 4.6,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 320,
    "max_price": 900,
    "min_price": 549
  },
  {
    "id": "regular-mutton-pickle",
    "title": "Regular Mutton Pickle",
    "image": "/MuttonPickle.jpg",
    "description": "Our Mutton Pickle is a rich and flavorful delicacy, made with tender mutton pieces slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, aromatic, and full of traditional goodness, it’s the perfect side to elevate our meals!",
    "slogan": "A rich and flavorful mutton delight!",
    "preparation_steps": [
      "Wash and cut mutton into small bite-sized pieces.",
      "Boil the mutton with turmeric powder, salt, and water until tender.",
      "Drain excess water and let it cool.",
      "Heat oil in a pan and deep-fry the boiled mutton pieces until they turn crispy and golden brown.", 
      "Remove and set aside.",
      "Dry roast mustard seeds, cumin seeds, fennel seeds, fenugreek seeds, and dry red chilies.",
      "Grind them into a fine powder.",
      "Heat oil in a pan, add mustard seeds, curry leaves, and chopped garlic.",
      "Sauté until fragrant, then add ginger-garlic paste and fry well.",
      "Add red chili powder, turmeric powder, and salt.",
      "Pour tamarind extract or vinegar for tanginess.",
      "Add the fried mutton pieces to the masala and mix well.",
      "Cook on low heat until the masala coats the mutton evenly.",
      "Let the pickle cool completely.",
      "Transfer to a clean, dry glass jar and pour extra oil to preserve it.",
      "Store in a cool, dry place for at least 2-3 days before using for better flavor.",
      "Enjoy your homemade Mutton Pickle with rice or chapati! 😊"
    ],
    "rate": 4.7,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 237,
    "max_price": 900,
    "min_price": 549
  },
  {
    "id": "boneless-mutton-pickle",
    "title": "Boneless Mutton pickle",
    "image": "/BonelessMuttonPickle.jpg",
    "description": "Our Boneless Mutton Pickle is a delicious treat, made with tender, boneless mutton pieces slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, aromatic, and bursting with rich flavors, it’s the perfect side to complement our meals!",
    "slogan": "Tender, boneless, and full of flavor!",
    "preparation_steps": [
      "Wash boneless mutton thoroughly and cut it into small bite-sized pieces.",
      "Boil the mutton with salt, turmeric powder, and a little water until tender.",
      "Drain excess water completely and let it cool.",
      "eat a pan and dry-roast the boiled mutton pieces on low flame until all moisture evaporates.",
      "Set aside to cool.",
      "Heat up peanut oil or sunflower oil in a deep pan.",
      "Fry the dried mutton pieces until golden brown and crispy.",
      "Remove and keep aside.",
      "Dry roast mustard seeds, fenugreek seeds, and cumin seeds.",
      "Grind them into a fine powder.",
      "In the same oil, add ginger-garlic paste and sauté until fragrant.",
      "Add red chili powder, turmeric powder, and coriander powder.",
      "Stir well and fry for a minute.",
      "Add the fried mutton pieces to the masala and mix well.",
      "Add vinegar or lemon juice for tanginess.",
      "Adjust salt and let it cook for 5 minutes on low flame.",
      "Let the pickle cool completely.",
      "Store in a clean, dry glass jar. Let it rest for a day before use for better flavor.",
      "Your Boneless Mutton Pickle is ready to enjoy! 🎉"
    ],
    "rate": 4.5,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 185,
    "max_price": 1000,
    "min_price": 600
  },
  {
    "id": "gongura-mutton-pickle",
    "title": "Gongura Mutton Pickle",
    "image": "/GonguraMuttonPickle.jpg",
    "description": "Our Gongura Mutton Pickle is a flavorful fusion of tender mutton pieces and tangy gongura leaves, slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, sour, and packed with authentic taste, it’s the perfect way to add a traditional touch to our meals!",
    "slogan": "A tangy twist to your mutton pickle!",
    "preparation_steps": [
      "Wash the mutton thoroughly and cut it into small bite-sized pieces.",
      "Boil the mutton with salt, turmeric powder, and a little water until tender.",
      "Drain excess water completely and let it cool.",
      "Wash the gongura (sorrel) leaves thoroughly and dry them completely.",
      "Heat a pan and dry-fry the leaves until they turn soft and slightly mushy.",
      "Heat oil in a pan, add cooked mutton and shallow fry on medium heat until golden brown.",
      "Remove and set aside.",
      "In the same oil, add mustard seeds, cumin seeds, dry red chilies, fenugreek seeds, and curry leaves.",
      "Sauté until the spices crackle.",
      "Add chopped garlic and fry until golden brown.",
      "Add cooked gongura leaves to the spice mixture and sauté well.",
      "Add red chili powder, coriander powder, garam masala, and salt.",
      "Stir well and cook for a few minutes.",
      "Mix in the fried mutton and cook until everything blends well.",
      "Allow the mixture to cool completely.",
      "Store in an airtight glass jar with extra oil on top for preservation.",
      "Let it rest for a day to enhance the flavors.",
      "Serve with hot rice and ghee for an authentic taste. Enjoy! 😊"
    ],
    "rate": 4.8,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 298,
    "max_price": 900,
    "min_price": 549
  },
  {
    "id": "regular-fish-pickle",
    "title": "Regular Fish Pickle",
    "image": "/FishPickle.jpg",
    "description": "Our Fish Pickle is a delicious blend of fresh fish pieces slow-cooked in our special mix of Indian spices and pure peanut or sunflower oil. Spicy, tangy, and full of coastal flavors, it’s the perfect side to enhance our everyday meals!",
    "slogan": "A coastal delight in every bite!",
    "preparation_steps": [
      "Wash the fish thoroughly, remove any scales, and cut it into small bite-sized pieces.",
      "Pat dry completely to remove excess moisture.",
      "In a bowl, mix turmeric powder, salt, and red chili powder.",
      "Coat the fish pieces evenly and let them marinate for 30 minutes.",
      "Heat oil in a pan and deep-fry the marinated fish pieces on medium heat until they turn golden brown and crispy.",
      "Remove and set aside.",
      "In the same oil, add mustard seeds and let them splutter.", 
      "Then add curry leaves, chopped garlic, ginger, and green chilies. Sauté until aromatic.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.",  
      "Stir well without burning the spices.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.", 
      "Stir well without burning the spices.",
      "Add vinegar to the masala and mix well. Let it simmer for a few minutes until the flavors blend.",
      "Add the fried fish pieces to the prepared masala and mix gently to coat every piece with the spicy pickle base.",
      "Let the pickle cool completely before storing it in a clean, dry, airtight glass jar.",
      "Allow the pickle to rest for at least 2-3 days to enhance the flavors before consuming.",
      "Now your Fish Pickle is ready to enjoy! 😋"
    ],
    "rate": 4.9,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 410,
    "max_price": 800,
    "min_price": 500
  },
  {
    "id": "boneless-fish-pickle",
    "title": "Boneless Fish Pickle",
    "image": "/BonelessFishPickle.jpg",
    "description": "Our Boneless Fish Pickle is a flavorful delight, made with tender, boneless fish pieces slow-cooked in our special blend of Indian spices and pure peanut or sunflower oil. Spicy, tangy, and packed with coastal goodness, it’s the perfect side to elevate our meals!",
    "slogan": "Tender, boneless, and full of flavor!",
    "preparation_steps": [
      "Wash the boneless fish thoroughly, remove any scales, and cut it into small bite-sized pieces.",
      "Pat dry completely to remove excess moisture.",
      "In a bowl, mix turmeric powder, salt, and red chili powder.",
      "Coat the fish pieces evenly and let them marinate for 30 minutes.",
      "Heat oil in a pan and deep-fry the marinated fish pieces on medium heat until they turn golden brown and crispy.",
      "Remove and set aside.",
      "In the same oil, add mustard seeds and let them splutter.", 
      "Then add curry leaves, chopped garlic, ginger, and green chilies. Sauté until aromatic.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.",  
      "Stir well without burning the spices.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.", 
      "Stir well without burning the spices.",
      "Add vinegar to the masala and mix well. Let it simmer for a few minutes until the flavors blend.",
      "Add the fried fish pieces to the prepared masala and mix gently to coat every piece with the spicy pickle base.",
      "Let the pickle cool completely before storing it in a clean, dry, airtight glass jar.",
      "Allow the pickle to rest for at least 2-3 days to enhance the flavors before consuming.",
      "Now your Fish Pickle is ready to enjoy! 😋"
    ],
    "rate": 4.6,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 320,
    "max_price": 900,
    "min_price": 549
  },
  {
    "id": "korameenu-pickle",
    "title": "Korameenu Pickle",
    "image": "/KorameenuPickle.jpg",
    "description": "Experience the authentic taste of Andhra with Arks Pickles' Korameenu Pickle, a perfect blend of deep-fried snakehead murrel (korameenu) and handpicked spices. Made with premium-quality fish and tempered in pure peanut or sunflower oil, our pickle delivers an explosion of flavor with every bite. Enjoy it with hot rice and experience the rich, homemade taste of tradition.",
    "slogan": "Authentic Andhra flavors in every bite!",
    "preparation_steps": [
      "Wash the korameenu (snakehead murrel) fish pieces thoroughly.",
      "Pat them dry completely to remove moisture.",
      "In a bowl, mix turmeric powder, salt, and red chili powder.",
      "Coat the fish pieces evenly and let them marinate for 30 minutes.",
      "Heat oil in a pan and deep-fry the marinated fish pieces on medium heat until they turn golden brown and crispy.",
      "Remove and set aside.",
      "In the same oil, add mustard seeds and let them splutter.", 
      "Then add curry leaves, chopped garlic, ginger, and green chilies. Sauté until aromatic.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.",  
      "Stir well without burning the spices.",
      "Reduce the heat and add red chili powder, turmeric powder, coriander powder, and a pinch of fenugreek powder.", 
      "Stir well without burning the spices.",
      "Add vinegar to the masala and mix well. Let it simmer for a few minutes until the flavors blend.",
      "Add the fried fish pieces to the prepared masala and mix gently to coat every piece with the spicy pickle base.",
      "Let the pickle cool completely before storing it in a clean, dry, airtight glass jar.",
      "Allow the pickle to rest for at least 2-3 days to enhance the flavors before consuming.",
      "Now enjoy! 😋 with hot rice"
    ],
    "rate": 4.7,
    "wishlist": false,
    "added_to_cart": false,
    "rating": 237,
    "max_price": 1000,
    "min_price": 600
  },
  {
    "id":"nuvulla-laddu",
    "title":"Nuvulla Laddu",
    "image":"/Nuvvulaladdu.jpg",
    "description":"Boost your health with Arks Pickles' Nuvvulu Laddu, a wholesome treat made with roasted sesame seeds and pure jaggery. Packed with natural calcium and essential nutrients, these laddus are not only delicious but also a powerhouse of energy.  Enjoy the traditional taste with every bite and give your family the goodness of homemade sweets.",
    "slogan": "A wholesome treat for your health!",
    "preparation_steps": [
      "Dry roast white sesame seeds in a pan on low flame until they turn golden and aromatic.",
      "Let them cool completely.",
      "Grind the roasted sesame seeds coarsely in a mixer. (Do not over-grind; they should be slightly coarse.)",
      "In a pan, melt jaggery with a little water until it reaches a sticky consistency (soft ball stage).",
      "Add cardamom powder for flavor.",
      "Pour the hot jaggery syrup into the ground sesame mixture and mix well.",
      "While the mixture is warm, take small portions and roll them into laddus using greased hands.",
      "Allow the laddus to cool and set completely before storing them in an airtight container.",
      "Enjoy your homemade Nuvvulu Laddu! 😊"
    ],
    "rate":4.5,
    "wishlist":false,
    "added_to_cart":false,
    "max_price": 600,
    "min_price":349,
    "rating": 14
  }, 
  {
    "id":"sunnuda-laddu",
    "title":"Sunundal Laddu",
    "image":"/Sunnundallu.jpg",
    "description":"Indulge in the rich and nutritious Arks Pickles' Sunundalu, made with finely roasted urad dal, ghee, and jaggery. Each laddu is crafted to perfection, offering a delightful melt-in-the-mouth experience while providing essential proteins and energy. Perfect for festivals, celebrations, or as a daily healthy snack, our Sunundalu brings you the authentic taste of Andhra.",
    "slogan": "A nutritious delight for every occasion!",
    "preparation_steps": [
      "Dry roast urad dal (black gram without skin) in a pan on low flame until golden brown and aromatic.",
      "Let it cool completely.",
      "Grind the roasted urad dal into a fine powder using a mixer.",
      "Sieve the powder to remove coarse particles.",
      "Grind jaggery (or sugar) into a fine powder and mix it with the urad dal powder.",
      "Add cardamom powder for extra flavor.",
      "Melt ghee in a pan until warm.",
      "Gradually pour warm ghee into the urad dal and jaggery mixture.",
      "Mix well until it forms a soft, moldable texture.",
      "Take small portions and roll them into laddus using greased hands.",
      "Allow the laddus to cool and set before storing them in an airtight container.",
      "Enjoy your delicious Sunundalu! 😊"
    ],
    "rate":4.5,
    "wishlist":false,
    "added_to_cart":false,
    "max_price": 550,
    "min_price":249,
    "rating": 14
  }, 
  {
    "id":"rawalla-laddu",
    "title":"Rawalla Laddu",
    "image":"/Ravvaladdu.jpg",
    "description":"Celebrate sweetness with Arks Pickles' Rava Laddu, a classic Indian treat made from roasted semolina, pure ghee, and crunchy cashews. Light, flavorful, and rich in taste, these laddus are perfect for festivals, gifting, or satisfying your sweet cravings. Handcrafted with love, our Rava Laddu ensures you get the taste of tradition in every bite.",
    "slogan": "A classic treat for your sweet cravings!",
    "preparation_steps": [ 
      "Heat a pan and dry roast rava (semolina) on low flame until it turns slightly golden and aromatic.",
      "Transfer it to a plate and let it cool.",
      "Grind sugar into a fine powder and mix it with cardamom powder.",
      "In a bowl, combine the roasted rava with powdered sugar.",
      "Heat ghee in a pan and fry cashews and raisins until golden.",
      "Add the fried nuts and warm ghee to the rava-sugar mixture.",
      "While the mixture is warm, take small portions and shape them into laddus using greased hands.",
      "Allow the laddus to cool and set completely before storing them in an airtight container.",
      "Enjoy your Rava Laddu! 😊"
    ],
    "rate":4.5,
    "wishlist":false,
    "added_to_cart":false,
    "max_price": 400,
    "min_price":200,
    "rating": 14
  }
]